verification/runs/T-family/T4b_runs/T4b_IJ_f/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

scale   1;

vertices
(
    (0 0 0)
    (0.01 0 -0.0004366094291)
    (0.01 0 0.0004366094291)
    (0.12 0 -0.005239313149)
    (0.12 0 0.005239313149)
    (0 0.04 0)
    (0.01 0.04 -0.0004366094291)
    (0.01 0.04 0.0004366094291)
    (0.12 0.04 -0.005239313149)
    (0.12 0.04 0.005239313149)
    (0 0.24 0)
    (0.01 0.24 -0.0004366094291)
    (0.01 0.24 0.0004366094291)
);

blocks
(
    hex (0 1 6 5 0 2 7 5) (144 192 1) simpleGrading (0.009222477556 415.2622923 1)
    hex (1 3 8 6 2 4 9 7) (288 192 1) simpleGrading (375.8451801 415.2622923 1)
    hex (5 6 11 10 5 7 12 10) (144 96 1) simpleGrading (0.009222477556 8 1)
);

edges ();

boundary
(
    plate
    {
        type            wall;
        faces           ( (0 1 2 0) (1 3 4 2) );
    }
    pipeWall
    {
        type            wall;
        faces           ( (6 11 12 7) );
    }
    inlet
    {
        type            mappedPatch;
        sampleMode      nearestCell;
        sampleRegion    region0;
        samplePatch     none;
        offsetMode      uniform;
        offset          (0 -0.1 0);
        faces           ( (10 11 12 10) );
    }
    entrainment
    {
        type            patch;
        faces           ( (6 8 9 7) );
    }
    farfield
    {
        type            patch;
        faces           ( (3 8 9 4) );
    }
    front
    {
        type            wedge;
        faces           ( (0 2 7 5) (2 4 9 7) (5 7 12 10) );
    }
    back
    {
        type            wedge;
        faces           ( (0 5 6 1) (1 6 8 3) (5 10 11 6) );
    }
);

mergePatchPairs ();
