verification/runs/T-family/T4b_runs/T4b_IJ_f/0.orig/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    inlet { type fixedValue; value uniform 293.15; }
    plate { type fixedGradient; gradient uniform 39248.20343; }
    pipeWall { type zeroGradient; }
    entrainment { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    farfield { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    front { type wedge; }
    back  { type wedge; }
}
